---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.PlanarMultiPlanarShape
source: html/5ceb005d-c8a9-045a-00bf-b9ef3059a78a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.PlanarMultiPlanarShape Property

The current shape is only bent in a single plane. A multi-planar definition is not required. Please redefine the shape on the top plane only.

## Syntax (C#)
```csharp
public static FailureDefinitionId PlanarMultiPlanarShape { get; }
```